---
kind: method
id: M:Autodesk.Revit.DB.XYZ.#ctor(System.Double,System.Double,System.Double)
zh: 点
source: html/fcb91231-2665-54b9-11d6-7ebcb7f235e2.htm
---
# Autodesk.Revit.DB.XYZ.#ctor Method

**中文**: 点

Creates an XYZ with the supplied coordinates.

## Syntax (C#)
```csharp
public XYZ(
	double x,
	double y,
	double z
)
```

## Parameters
- **x** (`System.Double`) - The first coordinate.
- **y** (`System.Double`) - The second coordinate.
- **z** (`System.Double`) - The third coordinate.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting an infinite number to the X, Y or Z property.